## Challenge 1907: Count Salary Categories

Table: Accounts


| Column Name | Type |
|-------------|------|
| account_id  | int  |
| income      | int  |

account_id is the primary key (column with unique values) for this table.
Each row contains information about the monthly income for one bank account.
 

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Accounts table:

| account_id | income |
|------------|--------|
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |

Output: 

| category       | accounts_count |
|----------------|----------------|
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |

Explanation: 
Low Salary: Account 2.
Average Salary: No accounts.
High Salary: Accounts 3, 6, and 8.

### Solution

In [1]:
import pandas as pd

In [ ]:
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    #Categorize for each account based on the income
    accounts['category'] = accounts['income'].apply(
        lambda x: 'High Salary' if x > 50000 else (
            'Average Salary' if 20000 <= x <= 50000 else 'Low Salary'
        )
    )

    #count the category for each account; if it's null, fill by 0
    counts = accounts['category'].value_counts().reindex(
        ['Low Salary', 'Average Salary', 'High Salary'], fill_value=0
    ).reset_index()

    counts.columns = ['category', 'accounts_count']
    return counts

In [25]:
data = pd.DataFrame({
    'account_id': [3,2,8,6],
    'income': [108939,12747,87709,91796]
})

In [21]:
count_salary_categories(data)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

In [27]:
# A good solution I learned from other users
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    low = 0
    avg = 0
    high= 0

    for x in accounts['income']:
        if x <20000:
            low+=1
        elif x<= 50000:
            avg+=1
        else:
            high+=1
    return pd.DataFrame({
        'category':['Low Salary','Average Salary','High Salary'],
        'accounts_count': [low,avg,high]
    })

In [28]:
count_salary_categories(data)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3